{"banner":"TESTLOTTE - Demo downtime on the portal on 12/05 from 6:15am until 6:30am. During that time the portal will be unavailable or partially not functioning..","news":{"items":[{"title":"Ultrapolymers and Domo extend partnership with Technyl","subTitle":"DOMO AND ULTRAPOLYMERS EXTEND PAN EUROPEAN DISTRIBUTION PARTNERSHIP TO INCLUDE ALL TECHNYL SOLUTIONS","date":"2022-04-30","content":"<ul><li><p>Ultrapolymers has been appointed as the pan European distributor for DOMO’s Technyl® products</p></li><li><p>The agreement complements the existing partnership between the companies</p></li><li><p>From May 1, Ultrapolymers will distribute the complete DOMO portfolio of PA6 and PA66, PPA and PPS based technical polymers</p></li><li><p>The move allows DOMO to reach end users across all European countries and to fulfill the needs of SMEs</p></li></ul><p>April 30, 2020 - DOMO Chemicals, a leading producer of engineering materials and Ultrapolymers, the pan-European distribution company, have announced a European distribution partnership. The acquisition of Solvay’s European Performance Polyamides Business (Polytechnyl) by DOMO initiated a change in Technyl® products distribution structure. From May 1, 2020, in addition to offering DOMO’s historical range of products, Ultrapolymers will operate as the pan European distributor for the company’s Technyl® products.</p><p>Marc Swatosch, European Product Manager at Ultrapolymers states: “Through this partnership with DOMO, one of the largest players in the polyamide market, we will be able to broaden our offering with a top quality PA6 and PA66 portfolio into all European countries with the exception of Serbia and Russia. Ultrapolymers’ existing DOMAMID® and ECONAMID® customers can expect to enjoy the same standards of service, but with an even broader offering.”</p><p><b>From May 1, Ultrapolymers will distribute the complete DOMO portfolio of PA6 and PA66, PPA and PPS based technical polymers sold under the TECHNYL®, DOMAMID®, THERMEC™ and ECONAMID® brands. </b>DOMO does not sell or distribute any Technyl® grades to customers and distributors outside the European Economic Area and Switzerland. TECHNYL® is a registered trademark of DOMO.</p><p>Besides being the number 2 polyamide producer in Europe, DOMO has focused on the development of sustainable solutions. With the Polytechnyl acquisition, the company’s sustainable product range has expanded significantly. It has added the Technyl® 4Earth® grades to the portfolio, which has been developed using recycled airbag fabric wastes.</p><p>Ron Bult, EP Global Sales Director at DOMO, says: &quot;The partnership we have with Ultrapolymers has been very successful from the outset. Ultrapolymers is reliable, easy to work with, professional and always looking to provide commercial and technical solutions. By extending our partnership to include the Polytechnyl business, we can now reach end users across all European countries and respond quickly to fulfill the needs of small to medium sizes customers across the continent.”</p><p>The transition to Ultrapolymers will take two months. In order to ensure a seamless transition for customers and business continuity, the two companies have created a Q&amp;A document which outlines all the practical details of this important change.</p><p><b>About DOMO Chemicals</b></p><p>DOMO Chemicals is a leading producer of high-quality engineering nylon materials for a diverse range of markets, including the automotive, construction, industrial and consumer goods, food, medical, pharmaceutical, chemicals and electronics industries. The company offers a complete portfolio of integrated nylon 6 and 66 products, including intermediates, resins, engineering plastics, performance fibres, packaging film and distribution of petrochemical products. Headquartered in Germany, the family-owned company leverages advanced technology and consumer insights to deliver sustainable &amp; innovative solutions. DOMO generated 2019 sales over EUR 900 million and employs in 2020 approximately 2200 employees worldwide.</p>"},{"title":"SK Global Chemical and Ultrapolymers reach distribution agreement for Primacor™, Primacor™ IO, Supreme™, Solumer™, Smart™, Yuclair™ brands in Europe","subTitle":"","date":"2021-11-25","content":"<p>Effective January 1st, 2021, Ultrapolymers will join the distribution network of SK Global Chemical for Primacor™, Primacor™ IO, Supreme™, Solumer™, Smart™, Yuclair™ product lines for the European market.</p><p>SK Global Chemical and Ultrapolymers management teams agree that this partnership constitutes a bright opportunity for both companies to strength their position in the European market.</p><p>Jeff Hobbins, European Product Manager at Ultrapolymers states “Through this partnership, with SK Global Chemical, one of the largest &amp; most respected players in the packaging sector, we are very excited to now be able to broaden our offering to customers with a top-quality portfolio for the Specialty &amp; Flexible packaging markets”.  </p><p><b>About SK Global Chemical</b></p><p>Since establishment, SKGC has been a wholly-owned subsidiary of SK Innovation Co, LTD, which acts as the intermediate holding company of SK Group’s energy and chemical business. SK Group is the 2nd largest conglomerate in South Korea in terms of sales (US$ 143Bn as of FY2018), with three major pillars of business: (1) Energy &amp; Chemicals, (2) Information, Telecommunications and Semiconductors, and (3) Marketing &amp; Services.</p><p>More information is available at <a href=\"http://eng.skglobalchemical.com/\">http://eng.skglobalchemical.com/</a></p>"},{"title":"Ultrapolymers extends portfolio with Clearlux® 816","subTitle":"Ultrapolymers is proud to extend our distribution of Ineos Styrolution grades to include Clearlux® 816.","date":"2022-04-23","content":"<p>Ultrapolymers is proud to extend our distribution of Ineos Styrolution grades to include Clearlux® 816. Clearlux® 816 MABS offers excellent flow, high impact, heat resistance, colourability and additionally offered in tinted versions. Clearlux® 816 complements Ultrapolymers extensive range of transparent materials. Please <a href=\"https://www.ultrapolymers.com/en/contact\">contact your local Ultrapolymers office</a> for more information. </p>"},{"title":"Ultrapolymers expands portfolio with Domo’s Technyl 4earth","subTitle":"Sustainable engineering plastics in focus ","date":"2022-05-07","content":"<p>Augsburg, May 2021. Due to regulatory requirements and an increasing sense of product stewardship, a steadily growing number of plastics processors, suppliers and OEMs are looking for sustainable alternatives to conventional materials. This is why Ultrapolymers has greatly expanded its portfolio of engineering plastics with reduced environmental footprints, including Domo&#39;s Technyl® 4earth® polyamides. This distributor’s many years of experience in making substitutions of this kind means it can help customers put them quickly and successfully into use. </p><p>Technyl 4earth is based on post-industrial or used technical textiles from stable sources, such as automotive airbags, ensuring a consistently high level of properties. Compared to conventional PA6.6 grades, the carbon footprint is reduced by a quarter, consumption of non-renewable resources by half and water consumption by more than two-thirds, while maintaining approximately the same performance. For example, the tensile stiffness of Technyl 4earth is slightly lower or even higher than that of the corresponding comparative grade, depending on the glass fiber content, while impact strength, for example, reaches an identical level with increasing heat aging (3000 h at 150°C). This opens up a promising route to greater resource efficiency in many demanding applications. </p><p>Other examples of the extensive portfolio of sustainable plastics available from Ultrapolymers include the Econamid® PA6 and PA6.6 grades, also from Domo, LyondellBasell‘s Moplen and Hostalen QCP PP and PE grades (Quality Circular Polymers) as well as the bio-based Circulen PP and PE grades, Terluran® Eco ABS from Ineos Styrolution, the EcoClear rPET grades from DuFor and the biopolymers from FKuR. </p><p>As Maximilian Deurer, Business Development Engineering Plastics at Ultrapolymers, says: &quot;We are seeing continuous growth in demand for solutions with a reduced environmental footprint. At the same time, however, there is also a need for reliably consistent properties over a long period of time as a fundamental requirement for technical parts that are often exposed to high stresses. We can meet this requirement with our environmentally friendly solutions in the form of recyclates or compounds based on them. This is demonstrated by the large number of successfully implemented substitutions in all sectors, in automotive and electrical and electronic applications as well as in general industry and consumer goods.&quot; </p>"}]}}